loadtest/results/big_before/statistics.json
{
  "GET /api/products (hot read path)" : {
    "transaction" : "GET /api/products (hot read path)",
    "sampleCount" : 3518,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 279.1813530415007,
    "medianResTime" : 147.0,
    "minResTime" : 42.0,
    "maxResTime" : 8794.0,
    "pct1ResTime" : 426.0,
    "pct2ResTime" : 756.1499999999992,
    "pct3ResTime" : 2829.749999999996,
    "throughput" : 29.446723026701264,
    "receivedKBytesPerSec" : 52855.29619425902,
    "sentKBytesPerSec" : 4.428511080187495
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3518,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 279.1813530415007,
    "medianResTime" : 147.0,
    "minResTime" : 42.0,
    "maxResTime" : 8794.0,
    "pct1ResTime" : 426.0,
    "pct2ResTime" : 756.1499999999992,
    "pct3ResTime" : 2829.749999999996,
    "throughput" : 29.446723026701264,
    "receivedKBytesPerSec" : 52855.29619425902,
    "sentKBytesPerSec" : 4.428511080187495
  }
}